app/views/trips/index.html.erb

      <td class=numeric><%= trip.odo %></td>
      <td><%= Trip.find(last_id).location %></td>
---
SELECT "trips".* FROM "trips" WHERE "trips"."id" = ? ORDER BY "trips"."id" ASC LIMIT 1  [["id", 1]]