app/views/trips/new.html.erb

SELECT "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "trips".* FROM "trips" ORDER BY "trips"."id" DESC LIMIT 1
---
  <div class="field">
  <% if not Trip.find(:all).empty? %>
    <% id = Trip.last.id %>