app/controllers/trips_controller.rb

SELECT "trips".* FROM "trips" WHERE "trips"."id" = ? ORDER BY "trips"."id" ASC LIMIT 1  [["id", 1]]
---
  def index
    if params[:car]
      @trips = Trip.where(car_id: params[:car])
    else
      @trips = Trip.all

SELECT "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT 1  [["id", ""]]
INSERT INTO "trips" ("created_at", "last_trip", "odo", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 07 Mar 2014 14:39:45 UTC +00:00], ["last_trip", 1], ["odo", 1], ["updated_at", Fri, 07 Mar 2014 14:39:45 UTC +00:00]]
---
  def create
    odo = trip_params[:odo]
    last_trip = Trip.find(trip_params[:last_trip])
    car = Car.find(trip_params[:car])
    @trip = Trip.new(:odo => odo, :last_trip => last_trip, :car => car, :user => current_user, :date => trip_params[:date])
    if(@trip.save)